app/views/orders/show.html.erb

    <div class="medium-12 columns">
      <h1><%= "#{@order.order_number} for #{@client.business_name}" %> </h1>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."client_id" = $1  ORDER BY "orders"."id" ASC LIMIT 1  [["client_id", 1]]