app/controllers/clients_controller.rb

INSERT INTO "clients" ("first_name", "last_name", "business_name", "email", "billing_email", "telephone", "mobile", "invoicing_address", "postcode", "country", "occupation", "other", "facebook", "twitter", "instagram", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
  def create
    @client = Client.new(client_params)
    if @client.save