app/controllers/dresses_controller.rb

  def index
    @dresses = Dress.all
---
SELECT "dresses".* FROM "dresses"

  def show
    @dress = Dress.find(params[:id])
---
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @dress = Dress.new(dress_params)
    if @dress.save
---
INSERT INTO "dresses" ("name", "description", "rrp", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Lara"], ["description", "Long flowing dress"], ["rrp", 226], ["created_at", "2016-07-20 16:29:21.629758"], ["updated_at", "2016-07-20 16:29:21.629758"]]

  def edit
    @dress = Dress.find(params[:id])
---
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    @dress = Dress.find(params[:id])

    if @dress.update(dress_params)
---
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "dresses" SET "image" = $1, "updated_at" = $2 WHERE "dresses"."id" = $3  [["image", "http://www.ilovelola.co.uk/wp-content/uploads/2015/03/paloma-1.jpg"], ["updated_at", "2016-07-21 13:55:56.310683"], ["id", 3]]