app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", nil]]
---
  def show
    @order = Order.find(params[:id])
    client_id = @order.client_id
    @client = Client.find(client_id)

SELECT "clients".* FROM "clients"
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @clients = Client.all
    unless params[:client_id].nil?
      @order = Order.new(:client_id => params[:client_id])
      3.times do
        item = @order.items.build
      end

      @client = Client.find(params[:client_id])

INSERT INTO "orders" ("order_number", "client_id", "expected_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_number", "ord001"], ["client_id", 1], ["expected_date", "2016-09-18"], ["created_at", "2016-07-25 15:45:10.803138"], ["updated_at", "2016-07-25 15:45:10.803138"]]
---
  def create
    @order = Order.new(order_params)
    if @order.save